test/autocannon-01.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars     
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 322 ms │ 826 ms │ 10640 ms │ 11509 ms │ 2595.57 ms │ 3222.15 ms │ 19143 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 227     │ 227     │ 662    │ 938    │ 640    │ 200,9   │ 227     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 53.4 kB │ 53.4 kB │ 156 kB │ 221 kB │ 150 kB │ 47.2 kB │ 53.3 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 12800 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 105          │
├────────────┼──────────────┤
│ 0.01       │ 105          │
├────────────┼──────────────┤
│ 0.1        │ 138          │
├────────────┼──────────────┤
│ 1          │ 268          │
├────────────┼──────────────┤
│ 2.5        │ 322          │
├────────────┼──────────────┤
│ 10         │ 519          │
├────────────┼──────────────┤
│ 25         │ 682          │
├────────────┼──────────────┤
│ 50         │ 826          │
├────────────┼──────────────┤
│ 75         │ 3546         │
├────────────┼──────────────┤
│ 90         │ 8053         │
├────────────┼──────────────┤
│ 97.5       │ 10640        │
├────────────┼──────────────┤
│ 99         │ 11509        │
├────────────┼──────────────┤
│ 99.9       │ 18484        │
├────────────┼──────────────┤
│ 99.99      │ 19140        │
├────────────┼──────────────┤
│ 99.999     │ 19143        │
└────────────┴──────────────┘

16k requests in 20.22s, 3.01 MB read
2k errors (0 timeouts)