test/autocannon-02.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

-
┌─────────┬────────┬────────┬──────────┬──────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼───────────┼────────────┼──────────┤
│ Latency │ 315 ms │ 753 ms │ 14856 ms │ 16993 ms │ 2932.5 ms │ 4128.95 ms │ 19570 ms │
└─────────┴────────┴────────┴──────────┴──────────┴───────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 236     │ 236     │ 670    │ 946    │ 675,1  │ 184,89  │ 236     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 55.5 kB │ 55.5 kB │ 158 kB │ 222 kB │ 159 kB │ 43.5 kB │ 55.5 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 13502 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 132          │
├────────────┼──────────────┤
│ 0.01       │ 139          │
├────────────┼──────────────┤
│ 0.1        │ 265          │
├────────────┼──────────────┤
│ 1          │ 295          │
├────────────┼──────────────┤
│ 2.5        │ 315          │
├────────────┼──────────────┤
│ 10         │ 537          │
├────────────┼──────────────┤
│ 25         │ 661          │
├────────────┼──────────────┤
│ 50         │ 753          │
├────────────┼──────────────┤
│ 75         │ 3455         │
├────────────┼──────────────┤
│ 90         │ 9626         │
├────────────┼──────────────┤
│ 97.5       │ 14856        │
├────────────┼──────────────┤
│ 99         │ 16993        │
├────────────┼──────────────┤
│ 99.9       │ 18347        │
├────────────┼──────────────┤
│ 99.99      │ 19464        │
├────────────┼──────────────┤
│ 99.999     │ 19570        │
└────────────┴──────────────┘

17k requests in 20.17s, 3.17 MB read
3k errors (0 timeouts)