test/autocannon-03.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 317 ms │ 696 ms │ 10905 ms │ 11416 ms │ 2231.32 ms │ 3007.43 ms │ 19098 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 287     │ 287     │ 721    │ 915    │ 738,75 │ 140,08  │ 287     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 67.5 kB │ 67.5 kB │ 169 kB │ 215 kB │ 174 kB │ 32.9 kB │ 67.4 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 14775 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 107          │
├────────────┼──────────────┤
│ 0.01       │ 111          │
├────────────┼──────────────┤
│ 0.1        │ 228          │
├────────────┼──────────────┤
│ 1          │ 280          │
├────────────┼──────────────┤
│ 2.5        │ 317          │
├────────────┼──────────────┤
│ 10         │ 505          │
├────────────┼──────────────┤
│ 25         │ 634          │
├────────────┼──────────────┤
│ 50         │ 696          │
├────────────┼──────────────┤
│ 75         │ 2372         │
├────────────┼──────────────┤
│ 90         │ 7670         │
├────────────┼──────────────┤
│ 97.5       │ 10905        │
├────────────┼──────────────┤
│ 99         │ 11416        │
├────────────┼──────────────┤
│ 99.9       │ 17697        │
├────────────┼──────────────┤
│ 99.99      │ 18825        │
├────────────┼──────────────┤
│ 99.999     │ 19098        │
└────────────┴──────────────┘

17k requests in 20.21s, 3.47 MB read
2k errors (0 timeouts)