test/autocannon-04.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 380 ms │ 843 ms │ 14447 ms │ 17179 ms │ 2753.55 ms │ 3987.79 ms │ 19607 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 182     │ 182     │ 535    │ 946    │ 584,3  │ 198,83  │ 182     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 42.8 kB │ 42.8 kB │ 126 kB │ 222 kB │ 137 kB │ 46.7 kB │ 42.8 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 11686 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 116          │
├────────────┼──────────────┤
│ 0.01       │ 116          │
├────────────┼──────────────┤
│ 0.1        │ 118          │
├────────────┼──────────────┤
│ 1          │ 286          │
├────────────┼──────────────┤
│ 2.5        │ 380          │
├────────────┼──────────────┤
│ 10         │ 586          │
├────────────┼──────────────┤
│ 25         │ 670          │
├────────────┼──────────────┤
│ 50         │ 843          │
├────────────┼──────────────┤
│ 75         │ 2141         │
├────────────┼──────────────┤
│ 90         │ 9739         │
├────────────┼──────────────┤
│ 97.5       │ 14447        │
├────────────┼──────────────┤
│ 99         │ 17179        │
├────────────┼──────────────┤
│ 99.9       │ 18799        │
├────────────┼──────────────┤
│ 99.99      │ 19326        │
├────────────┼──────────────┤
│ 99.999     │ 19607        │
└────────────┴──────────────┘

15k requests in 20.24s, 2.75 MB read
2k errors (0 timeouts)