test/autocannon-05.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 307 ms │ 725 ms │ 13815 ms │ 15878 ms │ 2198.39 ms │ 3201.58 ms │ 19123 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 320     │ 320     │ 692    │ 922    │ 691,3  │ 140,91  │ 320     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 75.3 kB │ 75.3 kB │ 163 kB │ 217 kB │ 162 kB │ 33.1 kB │ 75.2 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 13826 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 119          │
├────────────┼──────────────┤
│ 0.01       │ 134          │
├────────────┼──────────────┤
│ 0.1        │ 172          │
├────────────┼──────────────┤
│ 1          │ 286          │
├────────────┼──────────────┤
│ 2.5        │ 307          │
├────────────┼──────────────┤
│ 10         │ 512          │
├────────────┼──────────────┤
│ 25         │ 651          │
├────────────┼──────────────┤
│ 50         │ 725          │
├────────────┼──────────────┤
│ 75         │ 2754         │
├────────────┼──────────────┤
│ 90         │ 6173         │
├────────────┼──────────────┤
│ 97.5       │ 13815        │
├────────────┼──────────────┤
│ 99         │ 15878        │
├────────────┼──────────────┤
│ 99.9       │ 18297        │
├────────────┼──────────────┤
│ 99.99      │ 19106        │
├────────────┼──────────────┤
│ 99.999     │ 19123        │
└────────────┴──────────────┘

16k requests in 20.21s, 3.25 MB read
2k errors (0 timeouts)