test/autocannon-06.txt
autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ]  http://localhost:3000/cars
Running 2s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

/
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 296 ms │ 696 ms │ 10065 ms │ 11743 ms │ 1980.84 ms │ 2917.25 ms │ 18852 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 350     │ 350     │ 736    │ 991    │ 727,15 │ 156,95  │ 350     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 82.3 kB │ 82.3 kB │ 173 kB │ 233 kB │ 171 kB │ 36.9 kB │ 82.3 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 14543 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 118          │
├────────────┼──────────────┤
│ 0.01       │ 122          │
├────────────┼──────────────┤
│ 0.1        │ 216          │
├────────────┼──────────────┤
│ 1          │ 277          │
├────────────┼──────────────┤
│ 2.5        │ 296          │
├────────────┼──────────────┤
│ 10         │ 503          │
├────────────┼──────────────┤
│ 25         │ 628          │
├────────────┼──────────────┤
│ 50         │ 696          │
├────────────┼──────────────┤
│ 75         │ 1311         │
├────────────┼──────────────┤
│ 90         │ 6115         │
├────────────┼──────────────┤
│ 97.5       │ 10065        │
├────────────┼──────────────┤
│ 99         │ 11743        │
├────────────┼──────────────┤
│ 99.9       │ 17819        │
├────────────┼──────────────┤
│ 99.99      │ 18758        │
├────────────┼──────────────┤
│ 99.999     │ 18852        │
└────────────┴──────────────┘

17k requests in 20.25s, 3.42 MB read
2k errors (0 timeouts)